{
  "projects": [
    {
      "name": "Classy Weather App",
      "framework": "REACT JS VERSION 16 & BOOTSTRAP CSS",
      "description": "Display the weather forecast for the next 7 days, background image of app Dynamically change based on the weather conditions, Responsive Design for all screen. Discover app and get the weather information of your city.",
      "wideScreenImg": "https://iili.io/JhnMD7e.png",
      "mobileScreenImg": "https://iili.io/JhnMt29.png",
      "link": "https://yas8295.github.io/React-v.16-ClassyWether-app/"
    },
    {
      "name": "The Wild Oasis Hotel",
      "framework": "REACT JS & TAILWIND CSS",
      "description": "Fullstack App using Supabase with Authentication, Users can sign up by email, CRUD system users can create, update and delete cabins, users can check-in or check-out booking, dashboard with interactive charts and graphs. With Recharts library, Discover app and See more.",
      "wideScreenImg": "https://iili.io/JhnhW3N.png",
      "mobileScreenImg": "https://iili.io/JhnhM4p.png",
      "link": "https://yas8295.github.io/React-hotel-app/"
    },
    {
      "name": "Fast Pizza Resturant",
      "framework": "REACT JS & TAILWIND CSS",
      "description": "Simple App where users can order one or more pizzas from the Resturant menu, users can add multiple pizzas to cart before ordering, user input his name, phone number and address to delivery order, orders are made by sending a POST request with the order data to the API, animation by using Framer-motion Library, Dark mode feature, Visit App and Discover more.",
      "wideScreenImg": "https://iili.io/Jhnru6X.png",
      "mobileScreenImg": "https://iili.io/Jhnra9f.png",
      "link": "https://yas8295.github.io/React-Pizza-App/"
    },
    {
      "name": "WorldWise",
      "framework": "REACT JS & BOOTSTRAP CSS",
      "description": "WorldWise Keeps track of your adventures, a World map that tracks your footsteps into every city you can think of, Users can register all the cities that they have ever traveled to. Never forget your wonderful experiences, animation by using Framer-motion Library, Interactive map by using Leaflet library,  Dark mode feature, Discover app and See more.",
      "wideScreenImg": "https://iili.io/Jhn4tmx.png",
      "mobileScreenImg": "https://iili.io/Jhn4Q5b.png",
      "link": "https://yas8295.github.io/React-WorldWise-app/"
    },
    {
      "name": "usePopcorn",
      "framework": "REACT JS & TAILWIND CSS",
      "description": "a Small movies website that allows you to search through a vast collection of films, ranging from classics to the latest releases, Browse through extensive database of movies, including details such as plot summaries, cast and release dates, genres, and more, Additionally, you can create your own watchlist and track your favorite movies, Visit App and See more.",
      "wideScreenImg": "https://iili.io/JhN6Uge.png",
      "mobileScreenImg": "https://iili.io/JhN6S19.png",
      "link": "https://yas8295.github.io/React-usePopcorn-app/"
    },
    {
      "name": "The React Quiz",
      "framework": "REACT JS & BOOTSTRAP CSS",
      "description": "a Small quiz website about Javascript Framework ReactJS to test your knowledge, quizzes cover a wide range of topics, including React fundamentals, component lifecycle, state management, hooks, and more. Each quiz is designed to be informative and engaging, helping you improve your React skills while having fun, Let's Start and Challenge yourself.",
      "wideScreenImg": "https://iili.io/JhOR53x.png",
      "mobileScreenImg": "https://iili.io/JhORA4j.png",
      "link": "https://yas8295.github.io/React-Quiz-App/"
    },
    {
      "name": "Monteno",
      "framework": "Vanilla Javascript & html & BOOTSTRAP CSS",
      "description": "a Themeforest Template with more than 7 pages built using Vanilla Javascript ensuring compatibility across all devices and browsers. ensuring fast loading times and a smooth animation, Visit Website.",
      "wideScreenImg": "https://iili.io/JhO8RvR.png",
      "mobileScreenImg": "https://iili.io/JhO8AYv.png",
      "link": "https://yas8295.github.io/project9/index.html"
    },
    {
      "name": "Mapty",
      "framework": "Vanilla Javascript & html & BOOTSTRAP CSS",
      "description": "a web application that allows users to log their workouts (running or cycling) on a map, along with details such as distance, duration and workout type. Using Object-oriented programming (OOP) and the Leaflet library for map functionality and the Geolocation API to track user location, Users can click on the map to add a workout, which is then displayed as a marker on the map, including the ability to delete a workout. Each workout is stored in the browser's local storage, Discover app.",
      "wideScreenImg": "https://iili.io/JhOb1MG.png",
      "mobileScreenImg": "https://iili.io/JhOD5hu.png",
      "link": "https://yas8295.github.io/project8/"
    },
    {
      "name": "Pixelture",
      "framework": "Vanilla Javascript & html & BOOTSTRAP CSS",
      "description": "a Themeforest Template with more than 5 pages built using Vanilla Javascript with Responsive Design, Interactive Elements with animation, multi-step form and Images Slider by using SwiperJS library, Visit Website. ",
      "wideScreenImg": "https://iili.io/Jhe30oN.png",
      "mobileScreenImg": "https://iili.io/Jhe31VI.png",
      "link": "https://yas8295.github.io/project7/index.html"
    },
    {
      "name": "Bankist",
      "framework": "Vanilla Javascript & html & BOOTSTRAP CSS",
      "description": "Bankist is a fictional online banking website, The project typically includes features like user authentication, account summaries, transaction history and also ensuring Lazy Loading images, Images Slider, Tabs and animation, all features by just using Vanilla Javascript, Visit App.",
      "wideScreenImg": "https://iili.io/JhgKZDF.png",
      "mobileScreenImg": "https://iili.io/JhgKLAP.png",
      "link": "https://yas8295.github.io/project5/html/login.html"
    },
    {
      "name": "Hustbee",
      "framework": "Vanilla Javascript & html & Css",
      "description": "a Themeforest Template with more than 9 pages built using Vanilla Javascript ensuring compatibility across all devices and browsers. ensuring fast loading times, smooth animation, Images Slider and Dark mode Header by using Vanilla Javascript, Visit Website.",
      "wideScreenImg": "https://iili.io/JhgxEdJ.png",
      "mobileScreenImg": "https://iili.io/Jhgx0ga.png",
      "link": "https://yas8295.github.io/project6/"
    },
    {
      "name": "Elzero Project",
      "framework": "Vanilla Javascript & html & Css",
      "description": "One of Elzero Web School Youtube Channel Projects, Responsive Design, visual effects like transitions and animations to enhance user experience and some additional features such as Scroll top Button, Page Progeess bar and more, Visit Website.",
      "wideScreenImg": "https://iili.io/JhgrE3Q.png",
      "mobileScreenImg": "https://iili.io/JhgrcCb.png",
      "link": "https://yas8295.github.io/project3/"
    }
  ],
  "services": [
    {
      "name": "Web Development",
      "description": "Front-end developer, I transform the UI/UX design into Projects by using technologies like HTML,CSS, JAVASCRIPT and their Third-party libraries such as React JS and Tailwind CSS, Transform projects into Functional, Interactive Websites that deliver Exceptional Performance.",
      "icon": "FaLaptopCode"
    },
    {
      "name": "Integration with Back-end",
      "description": "Communicate and Integrate with back-end services by using the most common way APIs (Application Programming Interfaces) to fetch data, submit forms and perform other operations.",
      "icon": "FaCodeBranch"
    },
    {
      "name": "User Experience Optimization",
      "description": "Creating a positive and seamless experience for users, Improve the user experience based on user feedback and  analytics, ensuring that the application meets the needs and expectations of its users.",
      "icon": "MdOutlineSettingsSuggest"
    },
    {
      "name": "User Interface Design",
      "description": "Designing user interfaces that are visually appealing, intuitive to use, and aligned with the brand identity of the application, Responsive Design and optimal user experience across all devices screens, Interactive Features such as Animations, transitions, and real-time updates to enhance the user experience.",
      "icon": "LuLayoutDashboard"
    }
  ],
  "process": [
    {
      "name": "Request Project",
      "description": "It all starts with your project request. I listen carefully to understand what you need and your ideas. Your ideas are my inspiration, and understanding your goals is my top priority."
    },
    {
      "name": "Ideation",
      "description": "In this step, creativity takes center stage. I delve into brainstorming sessions to conceptualize your project. This is where I explore innovative solutions and artistic approaches to bring your vision to life."
    },
    {
      "name": "Designing",
      "description": "With a clear concept in mind, we move to the design phase. This is where I weave together visual elements, user-friendly interfaces, and all the creative components that will make your project stand out."
    },
    {
      "name": "Feedback",
      "description": "Your feedback is invaluable. I present the design work to you for your input. I'm dedicated to collaboration and will make revisions as necessary to ensure the final product aligns perfectly with your artistic vision."
    },
    {
      "name": "Launch",
      "description": "After your approval, it's time to release your project to the world. I handle all the technical details, ensuring a seamless launch. Your project is introduced to the public, where it will inspire and engage."
    }
  ]
}
